{
  "vehicles": [
    {
      "id": "1",
      "title": "2004 Mazda Tribute",
      "image": "https://i.imgur.com/TVBidwE.png",
      "description": "The 2004 Mazda Tribute is a compact SUV known for its reliable 2.3-liter petrol engine, spacious interior, and car-like handling. It offers a comfortable ride, good fuel efficiency, and versatility for both city driving and long trips. However, its design feels a bit outdated, and the interior materials are not top-notch. The specific model with over 2 million kilometers might have reduced fuel efficiency due to wear, but at 560,000 KES, it presents good value if thoroughly inspected."
    },
    {
      "id": "2",
      "title": "2008 Nissan Bluebird",
      "image": "https://i.imgur.com/HTuxAOW.png",
      "description": "The 2008 Nissan Bluebird is a 2000cc petrol, automatic vehicle in good running condition. It's well-known for being reliable and affordable to run and maintain. With a mileage of 126,000 KMS, it is priced at 650,000 KES (Negotiable). Viewing is available in Lavington. Contact: 0745-900-205."
    },
    {
      "id": "3",
      "title": "2015 Volkswagen Golf",
      "image": "https://i.imgur.com/Pvjp4fd.png",
      "description": "The 2015 Volkswagen Golf is like that dependable friend who always shows up with a smile. It's not flashy, but it knows how to make your daily commute feel like a mini adventure. It is a delightful choice for both practicality seekers and driving enthusiasts. This particular unit is a 1400cc petrol automatic transmission vehicle with 23,441kms on the clock. The asking price is 1.78 million KES. For further inquiries, call 0769-481-092."
    },
    {
      "id": "4",
      "title": "2015 Audi A4 2015",
      "image": "https://i.imgur.com/62sf1Wi.png",
       "description": "This particular unit is an Audi A4 2015 with automatic transmission and a petrol engine. It has fabric seats with a mileage of 150,574 km. Asking Price is 2.1M. Viewing in Lavington. For inquiries, call: 0769-481-092."
    },
    {
        "id": "5",
      "title": "2015 BMW X5",
      "image": "https://images.unsplash.com/photo-1635990215241-4d2805d729bb?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
      "description": "The 2015 BMW X5 is a luxury midsize SUV with a 3.0 liters turbocharged engine. It combines performance with luxury, offering advanced features and a comfortable ride. This model has a mileage of 70,000 KMS and is priced at 3,500,000 KES."
    },
    {
      "id": "6",
      "title": "2018 Mercedes-Benz C-Class",
      "image": "https://images.unsplash.com/photo-1664626692098-2e35eb4aa7ca?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MXx8bWVyY2VkZXMlMjBjJTIwY2xhc3N8ZW58MHx8MHx8fDA%3D",
      "description": "The 2018 Mercedes-Benz C-Class is a premium sedan with a 2.0-liter turbocharged engine. It offers a blend of luxury, technology, and performance. The vehicle has a mileage of 40,000 KMS and is priced at 4,200,000 KES."
    }
  ]
}

  
